#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.storage_bucket["bucket_0"].google_kms_crypto_key.terraform_tfstate will be created
+   resource "google_kms_crypto_key" "terraform_tfstate" {
+       destroy_scheduled_duration = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       import_only                = (known after apply)
+       key_ring                   = (known after apply)
+       name                       = "terraform-tfstate-key"
+       primary                    = (known after apply)
+       purpose                    = "ENCRYPT_DECRYPT"
+       rotation_period            = "86400s"
+       terraform_labels           = (known after apply)
    }

  # module.storage_bucket["bucket_0"].google_kms_key_ring.terraform_tfstate will be created
+   resource "google_kms_key_ring" "terraform_tfstate" {
+       id       = (known after apply)
+       location = "europe-southwest1"
+       name     = "terraform-tfstate-bucket"
+       project  = "neon-slate-415009"
    }

  # module.storage_bucket["bucket_0"].google_project_iam_member.storage_service_account will be created
+   resource "google_project_iam_member" "storage_service_account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:service-169494041067@gs-project-accounts.iam.gserviceaccount.com"
+       project = "neon-slate-415009"
+       role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.storage_bucket["bucket_0"].google_storage_bucket.terraform_state will be updated in-place
  ~ resource "google_storage_bucket" "terraform_state" {
        id                          = "terraform-tfstate-prod-bucket"
        name                        = "terraform-tfstate-prod-bucket"
        # (14 unchanged attributes hidden)

+       encryption {
+           default_kms_key_name = (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @PRubioDev, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request Main`*